api/dataapi/exts/QrckController.php

    public function beforeAction($action) {

        //return true;
        //var_dump($_SERVER);exit;
        $loginflag=false;
        $accessflag=true;
        if(parent::beforeAction($action)) {
            $method = $action->id;
            $controller = $action->controller->id;
            $module = $action->controller->module;
            if($module) {
                $route = $module->id. '/' .$controller . '/' . $method;
            } else {
                $route = $controller . '/' . $method;
            }

            $username=@$_SERVER['HTTP_X_AUTH_CLIENT'];
            $token=@$_SERVER['HTTP_X_AUTH_TOKEN'];
            $lname=UtilFilter::addslashesStr($username);

            if(!empty($username) && !empty($token)){

                $users=BasicUser::find()->where(['login_name' => $lname,'status'=>1])->one();
---
SELECT * FROM `basic_user` WHERE (`login_name`='admin') AND (`status`=1)