api/dataapi/modules/cms/controllers/CategoryController.php

SELECT `id`, `pid`, `name` AS `text` FROM `cms_category`
---
    public function actionGetcategory()
    {

        $data = CmsCategory::find()->select('id,pid,name as text')->asArray()->all();

SELECT `id`, `pid`, `name` AS `text` FROM `cms_category`
---
    public function actionArrcategory()
    {
//        $model->setattribute("status", $showtype);
        $data = CmsCategory::find()->select('id,pid,name as text')->asArray()->all();