api/dataapi/modules/cms/controllers/FlinkController.php

SELECT COUNT(*) FROM `cms_flink`
---
    public function actionIndex()
    {

        $model = CmsFlink::find();
        $model->select('id,pid,name as text, lan,url,rank,status,created,updated');

        $status = Yii::$app->request->get("status", "");
        $keyword = Yii::$app->request->get("keyword", "");
        $keytype = Yii::$app->request->get("keytype", "");
        if (!empty($status)) {
            $status = UtilFilter::addslashesStr($status);
            $model->andWhere(" status = $status");
        }
        //文本搜索模糊查询
        if (!empty($keyword)) {
            $keyword = UtilFilter::addslashesStr($keyword);
            $keytype = UtilFilter::addslashesStr($keytype);
            $keytypes = explode(',', $keytype);
            $Where = '';
            foreach ($keytypes as $k => $keytype) {
                if ($k == 0) {
                    $Where = "    $keytype like '%$keyword%' ";
                } else {
                    $Where .= " or $keytype like '%$keyword%' ";
                }
            }
            $model->andWhere(" $Where ");
        }


        $total = $model->count();

SELECT * FROM `cms_flink` WHERE `id`='3'
---
    public function actionView()
    {

        $id = Yii::$app->request->get('id', 0);
        $data = CmsFlink::findOne($id);