api/dataapi/modules/admin/controllers/LoginController.php

SELECT * FROM `basic_user` WHERE login_name='admin' and pwd ='1b89098c1fff9c91b71f8c4a08194df9' and status=1
---
    public function actionToken(){
            $parm=Yii::$app->getRequest()->getBodyParams();

            $lname=isset($parm['login_name'])?trim($parm['login_name']):"";
            $lname=UtilFilter::addslashesStr($lname);
            $enter_pwd=isset($parm['pwd'])?trim($parm['pwd']):"";
            $pwd=UtilEncryption::encryptMD5($enter_pwd,Yii::$app->params['secret']['pwd']);

            $model=BasicUser::find();
            $model=$model->where("login_name='".$lname."' and pwd ='".$pwd."' and status=1")->asArray()->one();