api/dataapi/modules/admin/controllers/UserController.php

    public function actionMenus()
    {
        $pid = Yii::$app->request->get("pid", "");
        $type = intval(Yii::$app->request->get("t", "1"));//需求返回类型   1：数组  2：树
        $uid = intval($this->_login_user_id);

        $users = BasicUser::findOne($uid);//获取登录用户信息
        $menus = array();
        $mids = array();
        if ($users) {
            $roleid = $users->role_ids;

            if (!empty($roleid)) {
                $rolemenu = BasicRoleMenu::find()->where("role_id in (" . $roleid . ")")->all();
                if ($rolemenu) {
                    foreach ($rolemenu as $key => $value) {

                        $bmenu = BasicMenu::findOne($value->menu_id)->toArray();
---
SELECT * FROM `basic_user` WHERE `id`=39
SELECT * FROM `basic_role_menu` WHERE role_id in (1)
SELECT * FROM `basic_menu` WHERE `id`=1